Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.0.17/CA80/svd/PIC32CZ8110CA80176.svd
               <register>
                  <dim>32</dim>
                  <dimIncrement>1</dimIncrement>
                  <name>PINCFG[%s]</name>
                  <description>Pin Configuration</description>
                  <addressOffset>0x40</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>PMUXEN</name>
                        <description>Peripheral Multiplexer Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INEN</name>
                        <description>Input Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PULLEN</name>
                        <description>Pull Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ODRAIN</name>
                        <description>Open Drain Output</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SLEWLIM</name>
                        <description>Output Driver Slew Rate Selection</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>SLEWLIMSelect</name>
                           <enumeratedValue>
                              <name>FAST</name>
                              <description>Slew rate control disabled (fast rise/fall time operation)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SLOW4</name>
                              <description>Slew rate control enabled (4x slower)</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SLOW8</name>
                              <description>Slew rate control enabled (8x slower)</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SLOW12</name>
                              <description>Slew rate control enabled (12x slower)</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
            </cluster>
         </registers>
      </peripheral>
      <peripheral derivedFrom="PORT">
         <name>PORT_AHB</name>
         <prependToName>PORT_AHB_</prependToName>
         <baseAddress>0x40000000</baseAddress>
      </peripheral>
      <peripheral>
         <name>PRM</name>
         <version>035751a0</version>
         <description>Boot ROM Controller</description>
         <groupName>PRM</groupName>
         <prependToName>PRM_</prependToName>
         <baseAddress>0x44080000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>CONTROL A REGISTER</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>SOFTWARE RESET BIT</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>ENABLE BIT</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRMWS</name>
                     <description>ROM ACCESS TIME WAIT STATE</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>PTC</name>
         <version>037216a0</version>
         <description>Peripheral Touch Controller</description>
         <groupName>PTC</groupName>
         <prependToName>PTC_</prependToName>
         <baseAddress>0x46828000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1</size>
            <usage>reserved</usage>
         </addressBlock>
         <interrupt>
            <name>PTC</name>
            <value>191</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>RSTC</name>
         <version>039261a0</version>
         <description>Reset Controller</description>
         <groupName>RSTC</groupName>
         <prependToName>RSTC_</prependToName>
         <baseAddress>0x44030000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>RCAUSE</name>
               <description>Reset Cause</description>
               <addressOffset>0x0</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>POR</name>
                     <description>Power On Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PORCORE</name>
                     <description>Brown Out CORE Detector Reset</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BORVDDREG</name>
                     <description>Brown Out VDDREG Detector Reset</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BORVDDA</name>
                     <description>Brown Out VDDA Detector Reset</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BORVDDIO</name>
                     <description>Brown Out VDDIO Detector Reset</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXT</name>
                     <description>External Reset</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDT</name>
                     <description>Watchdog Reset</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYST</name>
                     <description>System Reset Request</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BACKUP</name>
                     <description>Backup Reset</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKUP</name>
                     <description>Lockup Reset</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKUPEXIT</name>
               <description>Backup Exit Source. Implemented only if RSTC_BACKUP_IMPLEMENTED=1</description>
               <addressOffset>0x2</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>RTC</name>
                     <description>Real Timer Counter Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HIB0</name>
                     <description>Hibernate</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DBGCTRL</name>
               <description>Debug Control</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LCKUPDIS</name>
                     <description>Lockup Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
